[
  {
    "id": 3,
    "name": "Hogwarts - The Adaptive Web Based Information System",
    "summary": "",
    "date": "14th April 2017",
    "tags": ["University", "Web Development"],
    "htmlTitle": "hogwarts-adaptive-web-information-system",
    "imageURL": "src/images/hogwarts.jpg"
  },
  {
    "id": 0,
    "name": "Let's Go! Get the Go Lang",
    "summary": "The Go programming language is an exciting new language that you should have learned a year ago already (including me). It's a language featuring native concurrency, static typing and standards driven development. Let's dive in for a look at some of the cool things that you can be doing.",
    "date": "1st January 2017",
    "tags": ["Web Development"],
    "htmlTitle": "get-the-go-lang.html",
    "imageURL": "src/images/go.png"
  },
  {
    "id": 1,
    "name": "My Polyphasic Sleep Experience: Almost an Everyman",
    "summary": "It's Christmas Day. Last night was the most tired night in a long while, and yet that very same morning all my stress was gone. Worries of not making it on time were unfounded. I had all the time in the world and I was loving it. So despite getting ill, feeling the stress of having such a nap rhythm, it's beginning to look a lot like success.",
    "date": "25th December 2015",
    "tags": ["Sleep", "Experimental"],
    "htmlTitle": "my-polyphasic-sleep-experience-almost.html",
    "htmlContent": "<div>\n                <div class='lead-letter'>C</div>\n                thristmas Day. 6:30am. I'm writing this because I now have an ungodly amount of time at my disposal\n                and without too much pain to stay awake. Yesterday I started again with the everyman sleep schedule.\n                Yes that's right; again. For at the end of last week, I came down with quite an awful cold which\n                knocked me out solid for a couple of days. After reading a lot about how to deal with this properly,\n                I decided that because I was mid way through adaptation, and hadn't been doing this for that long of a\n                time, I could afford to \"start again\" you might say; I beg to differ on the concept of starting again\n                since your body is already far more accustomed to naps at this point than at any time in the past.\n            </div>\n\n            <p>\n                But now I'm back, and after living on the Everyman schedule for a while now,\n                I want to go over some of the most crucial points of my experience so you can\n                decide yourself whether or not this is something for you.\n            </p>\n            <h2>Illness will force you back to old habits</h2>\n            <p>\n                During the last two weeks, about 4 days was spent sleeping simply as much as possible, whenever possible.\n                This was indeed when I was ill. For me, I found it best to do it this way. There are however a number of\n                other ways to do it according to other sources which include:\n            </p>\n            <ul>\n                <li> Extend your nap times from 20 minutes to 40 minutes</li>\n                <li> Have as many 3.5 hour core sleeps as needed throughout the day</li>\n                <li> Nap for 20 minutes every hour, on the hour</li>\n            </ul>\n            <br>\n            <p>\n                Different people have their own ways of dealing with illness and so this list is by no means\n                complete or the right course of action. Just remember that getting ill while on the Everyman 3\n                schedule will set you back a lot unless you're fully adapted and have been for a long time already.\n            </p>\n            <h2>You have more time but you have less time</h2>\n            <p>\n                Although this may seem contradictory, let me first explain. I started the Everyman sleep schedule in\n                order to get more things done that I needed to achieve in an already jam packed day. I now pack for\n                my trips away completely stress free, I can dedicate more time to getting achievements in the games\n                that I play, I can start preparing for my university work and crossing a bunch of items off of my to do\n                list. All things that I wanted to gain from this experience; having my personal alone time to do what\n                I need to finish for myself is fantastic!\n            </p>\n            <p>\n                But the other side of the picture shows a different story. It's just that isn't it? Personal. Alone.\n                Myself. It's a sleep schedule that lets you get things done for yourself, but then less for others.\n                If anything, it's bound to annoy others.Let's take a look to see how the example schedule looks over time:\n            </p>\n            <ul>\n                <li>Core 1: 0000 - 0330</li>\n                <li>Nap 1: 0710 - 0730</li>\n                <li>Nap 2: 1117 - 1137</li>\n                <li>Nap 3: 1740 - 1800</li>\n            </ul>\n            <p>And now let's take a different perspective:</p>\n            <ul>\n                <li>Time awake: 3:40</li>\n                <li>Time awake: 3:40</li>\n                <li>Time awake: 6:10</li>\n                <li>Time awake: 6:00</li>\n            </ul>\n            <p>\n                As you can see, if you wanted to go on a day trip somewhere, you would have to find somewhere to nap.\n                You can't go out partying, because you need your core sleep. If you're hosting a festive celebration,\n                you'll need to explain to everyone that they need to do their own thing for 20 minutes or so while you\n                go and lie down. Hiking in the mountains? No chance.\n            </p>\n            <p>\n                You may of course be able to get to a point\n                where you can even sleep on the cold muddy floor of a marsh during one of your hikes. If this is you then\n                great! If however you are not in this unique group of people, then perhaps thinking about whether you are\n                ready to deal with a drastic change in the way you live out your social life is the way to go before\n                deciding if you need the extra time after all. At the end of the day it feels like you are living short\n                bursts with naps all of the time.\n            </p>\n            <hr>\n            <div class='post-showcase'> \"It feels like you are living in short bursts with naps all of the time.\"</div>\n            <hr>\n            <h2>You see yourself as truly a member of the 24 hour world</h2>\n            <p>\n                Now while it is true that the Uberman sleep schedule (sleeping for 20 minute naps,\n                6 times a day thus giving you only 2 hours of sleep per day) has this effect more so than any other\n                schedule, after sleeping on an Everyman rhythm for a while now, it feels absolutely amazing.\n                You never miss the sunrise and you never miss the sunset. You wake up, you take the trash outside at\n                4am. You got to the 24 hour store to do some groceries at 5am because you thought, \"You know what?\n                I'm out of milk and I also fancy a croissant.\"You see the world waking up, and you see it going to bed.\n                You feel like you can take advantage of all the 24 hour facilities that the world has to offer and that\n                time is no longer of too much importance to you. It feels wonderful, it's euhphoric and is just one of\n                the reasons that I will be carrying on this sleep schedule a long time into the future.\n            </p>",
    "imageURL": "src/images/couch.jpg"
  },
  {
    "id": 2,
    "name": "Visual Regression Testing At StudyPortals",
    "summary": "Testing is a very important part of web development, but on the front-end with a lot of dom operations and not so much computational logic, it is a bit redundant to write unit tests when other test methodologies bring more value. Enter Visual Regression Testing, which aims to find differences between screenshots of different versions of the code.",
    "date": "25th December 2015",
    "tags": ["Testing", "Web Development", "StudyPortals"],
    "htmlTitle": "visual-regression-testing-at-studyportals.html"
  }
]
